{
  "chapter": "4",
  "title": "Swayamvara of Sita",
  "content": [
    "After completing Vishwamitra’s mission, Rama and Lakshmana continued their journey with the sage, reaching the kingdom of Mithila, ruled by King Janaka.",
    "Janaka had a beautiful and virtuous daughter, Sita, who was believed to be born from the earth when the king discovered her while plowing a field. She was revered as an incarnation of Goddess Lakshmi.",
    "To find a worthy husband for Sita, Janaka organized a swayamvara—a ceremony where suitors competed for her hand. The challenge was to lift, string, and break the mighty bow of Lord Shiva, a task no man had accomplished.",
    "Princes and kings from all over the world gathered, attempting but failing to even move the divine bow. The court was filled with tension and anticipation.",
    "At Vishwamitra’s encouragement, Rama stepped forward. To everyone’s astonishment, he not only lifted the bow with ease but also broke it while stringing it, signaling his divine strength and destiny.",
    "Sita, witnessing Rama’s valor and humility, chose him as her husband by placing a garland around his neck in the swayamvara tradition.",
    "The joyous event was celebrated with grandeur, and Rama’s brothers were also married to Sita’s sisters, solidifying a bond between the families.",
    "The swayamvara marked the beginning of a divine partnership between Rama and Sita, whose lives would become intertwined with the epic tale of dharma and sacrifice."
  ],
  "funfacts": [
    "The bow of Shiva, known as 'Pinaka,' was so heavy that it required a team of men just to transport it.",
    "Sita’s name means 'furrow' in Sanskrit, referencing her discovery during King Janaka’s plowing ritual.",
    "The breaking of Shiva’s bow is a symbolic event, representing Rama’s divine mission to uphold dharma.",
    "Rama’s victory at the swayamvara fulfilled a prophecy that only Lord Vishnu, in human form, could lift the bow.",
    "The simultaneous marriage of Rama’s brothers—Bharata, Lakshmana, and Shatrughna—to Sita’s sisters is often seen as a celebration of unity and harmony."
  ]
}
