{
    "chapter": "5",
    "title": "The Exile of Rama",
    "content": [
      "After Rama’s marriage to Sita, the couple returned to Ayodhya, where they were warmly welcomed. Rama’s valor and virtue made him the beloved heir to the throne.",
      "As King Dasharatha grew old, he decided to crown Rama as the next king. The citizens of Ayodhya rejoiced at the announcement, for Rama was adored for his wisdom, courage, and compassion.",
      "However, Kaikeyi, one of Dasharatha’s queens, was manipulated by her maid Manthara into fearing that her own son, Bharata, would lose power under Rama’s rule.",
      "Reminded of two boons Dasharatha had promised her long ago, Kaikeyi demanded that Rama be exiled to the forest for 14 years and that Bharata be crowned king instead.",
      "Dasharatha was devastated by her request but felt bound by his promise. Rama, out of duty and respect for his father, willingly accepted the exile without question.",
      "Sita, deeply devoted to her husband, insisted on accompanying Rama into the forest, as did Lakshmana, who refused to leave his brother’s side.",
      "The three left Ayodhya, bidding tearful farewells to their family and the citizens. Dasharatha, overcome by grief and guilt, passed away shortly after their departure.",
      "This exile marked the beginning of Rama’s journey of trials and tribulations, where his righteousness and strength would be tested at every turn."
    ],
    "funfacts": [
      "Kaikeyi originally loved Rama as much as her own son Bharata, but Manthara’s manipulation changed her perspective.",
      "Dasharatha’s two boons to Kaikeyi were granted when she saved his life during a battle, showcasing her bravery and loyalty.",
      "Rama’s willingness to accept exile reflects his commitment to dharma, even when faced with personal loss.",
      "Sita’s decision to accompany Rama is a symbol of her unwavering love and dedication, often cited as the ideal of marital devotion.",
      "The 14-year exile period corresponds to a significant time of spiritual growth and transformation in ancient Indian philosophy."
    ]
  }
  